Coldcard/firmware/stm32/mk4-bootloader/ae.c
        if(actual < max_expect) {
            *(p++) = ch;
        }
    }

    // Sometimes our framing is not perfect.
    // We might get a spurious bit at the leading edge (perhaps an echo
    // of part of the 0x88??) or junk at the end.
    actual &= ~7;
    deserialize(raw, actual, buf, max_len);

    return actual / 8;
}

// ae_wake()
//
// Do not call this causually: it may cause next read to return 0x11 (After Wake,
// Prior to First Command) as an error to any on-going/attempted operation.
//
//
    static void
ae_wake(void)
{
    // send zero (all low), delay 2.5ms
    _send_byte(0x00);

    delay_ms(3);     // measured: ~2.9ms

    _flush_rx();
}

// ae_send_sleep()
//
	static void
ae_send_sleep(void)
{
	// "The ATECC508A goes into the low power sleep mode and ignores all
	// subsequent I/O transitions until the next wake flag. The entire volatile
	// state of the device is reset"
    ae_wake();

    _send_bits(IOFLAG_SLEEP);
}

// ae_send_idle()
//
	static void
ae_send_idle(void)
{
	// "The ATECC508A goes into the idle mode and ignores all subsequent
	// I/O transitions until the next wake flag. The contents of TempKey
	// and RNG Seed registers are retained."
    ae_wake();

    _send_bits(IOFLAG_IDLE);
}

// ae_reset_chip()
//
    void
ae_reset_chip(void)
{
    if(ae_chip_is_setup == AE_CHIP_IS_SETUP) {
        // "The ATECC508A goes into the low power sleep mode and ignores all
        // subsequent I/O transitions until the next wake flag. The entire volatile
        // state of the device is reset"
        _send_bits(IOFLAG_SLEEP);
    } else {
        // we may not have a working UART, and we probably didn't
        // talk to the chip, so skip it.
    }
}


// ae_setup()
//
// Configure pins. Do not attempt to talk to chip.
//
    void
ae_setup(void)
{
#ifdef DEV_STATS
    memset(&stats, 0, sizeof(stats));
#endif

    // enable clock to that part of chip
    __HAL_RCC_UART4_CLK_ENABLE();

    // copy config values from a running system, setup by mpy code
    // - except disable all interrupts
    // - mpy code will have to clean this up, see ...reinit() member func
    //
    // For max clock error insensitivity:
    // OVER8==0, ONEBIT=1

    // disable UART so some other bits can be set (only while disabled)
    MY_UART->CR1 = 0;
    MY_UART->CR1 = 0x1000002d & ~(0
                                    | USART_CR1_PEIE 
#ifdef USART_CR1_TXEIE
                                    | USART_CR1_TXEIE 
#endif
                                    | USART_CR1_TCIE 
#ifdef USART_CR1_RXNEIE
                                    | USART_CR1_RXNEIE
#endif
                                    | USART_CR1_IDLEIE
                                    | USART_CR1_OVER8
                                    | USART_CR1_UE);

    MY_UART->RTOR = 24;                  // timeout in bit periods: 3 chars or so
    MY_UART->CR2 = USART_CR2_RTOEN;      // rx timeout enable
    MY_UART->CR3 = USART_CR3_HDSEL | USART_CR3_ONEBIT;
#if HCLK_FREQUENCY == 80000000
    MY_UART->BRR = 0x0000015b;          // 230400 bps @ 80 Mhz SYSCLK
#elif HCLK_FREQUENCY == 120000000
    MY_UART->BRR = 521;                 // 230400 bps @ 120 Mhz SYSCLK
#else
#   error "needs math"
#endif

    // clear rx timeout flag
    MY_UART->ICR = USART_ICR_RTOCF;

    // finally enable UART
    MY_UART->CR1 |= USART_CR1_UE;
    
    // configure pin A0 to be AFx_UARTy, PULL_NONE
    // should already be done: gpio_setup();
    
    // mark it as ready
    ae_chip_is_setup = AE_CHIP_IS_SETUP;

    rng_delay();
}

// ae_probe()
//
	const char *
ae_probe(void)
{
    rng_delay();

    // Make it sleep / wake it up.
	ae_send_sleep();

    // Wake it again (to reset state)
    ae_wake();

	// do a real read w/ CRC
	// with no command happening, expect 0x11: "After Wake, prior to first command"
    ae_read1();

	uint8_t chk = ae_read1();
	if(chk != AE_AFTER_WAKE) return "wk fl";

    // read the serial number one time
    uint8_t serial[6];
	if(ae_get_serial(serial)) return "no ser";

	// put into a low-power mode, might be a bit before we come back
	ae_send_sleep();

    rng_delay();

	return NULL;
}


// ae_keep_alive()
//
	void
ae_keep_alive(void)
{
	// To reset the watchdog, (1) put it into idle mode, then (2) wake it.
	ae_send_idle();

    // no need to wake: next transaction will do that 
	//ae_wake();
    rng_delay();
}

// Originally from Libraries/ecc108_library/ecc108_helper.c

/** This function calculates CRC.
 *
 * crc_register is initialized with *crc, so it can be chained to
 * calculate CRC from large array of data.
 *
 * For the first calculation or calculation without chaining, crc[0]
 * and crc[1] values must be initialized to 0 by the caller.
 *  
 * \param[in] length number of bytes in buffer
 * \param[in] data pointer to data for which CRC should be calculated
 * \param[out] crc pointer to 16-bit CRC
 */ 
	static void
crc16_chain(uint8_t length, const uint8_t *data, uint8_t crc[2])
{
    uint8_t counter;
    uint16_t crc_register = 0;
    uint16_t polynom = 0x8005;
    uint8_t shift_register;
    uint8_t data_bit, crc_bit;
    
    crc_register = (((uint16_t) crc[0]) & 0x00FF) | (((uint16_t) crc[1]) << 8);
    
    for (counter = 0; counter < length; counter++) {
      for (shift_register = 0x01; shift_register > 0x00; shift_register <<= 1) {
         data_bit = (data[counter] & shift_register) ? 1 : 0;
         crc_bit = crc_register >> 15;

         // Shift CRC to the left by 1.
         crc_register <<= 1; 

         if ((data_bit ^ crc_bit) != 0)
            crc_register ^= polynom;
      }  
    }
        
    crc[0] = (uint8_t) (crc_register & 0x00FF);
    crc[1] = (uint8_t) (crc_register >> 8);
}   

// ae_check_crc()
//
	static bool
ae_check_crc(const uint8_t *data, uint8_t length)
{
	uint8_t obs[2] = { 0, 0 };

	if(data[0] != length) {
		// length is wrong
        STATS(crc_len_error++);
		return false;
	}

	crc16_chain(length-2, data, obs);

	return (obs[0] == data[length-2] && obs[1] == data[length-1]);
}

