Coldcard/firmware/stm32/mk4-bootloader/ae.c
// ae_read1()
//
// Read a one-byte status/error code response from chip. It's wrapped as 4 bytes: 
//	(len=4) (value) (crc16) (crc16)
//
	int
ae_read1(void)
{
	uint8_t msg[4];

	for(int retry=7; retry >= 0; retry--) {
        // tell it we want to read a response, read it, and deserialize
        int rv = ae_read_response(msg, 4);

        if(rv == 0) {
            // nothing heard, it's probably still processing
            ERR("not rdy");
            STATS(not_ready++);

            delay_ms(5);
            goto try_again;
        }

        if(rv != 4) {
            ERR("rx len");
            STATS(len_error++);
            goto try_again;
        }

		// Check length and CRC bytes. we will retry a few times
		// if they are wrong.
		if(!ae_check_crc(msg, 4)) {
			ERR("bad crc");
            STATS(crc_error++);
			goto try_again;
		}

        STATS(last_resp1 = msg[1]);

		// done, and it worked; return the one byte.
		return msg[1];

	try_again:
        STATS(l1_retry++);
	}

	// fail.
	return -1;
}

// ae_read_n()
//
// Read and check CRC over N bytes, wrapped in 3-bytes of framing overhead.
//
	int
ae_read_n(uint8_t len, uint8_t *body)
{
    uint8_t tmp[1+len+2];

	for(int retry=7; retry >= 0; retry--) {

        int actual = ae_read_response(tmp, len+3);
        if(actual < 4) {

            if(actual == 0) {
                // nothing heard, it's probably still processing
                delay_ms(5);
                ERR("not ready2");
                STATS(not_ready_n++);
            } else {
                // a weird short-read? probably fatal, but retry
                ERR("too short");
                STATS(short_error++);
            }
            goto try_again;
        }

        uint8_t resp_len = tmp[0];
		if(resp_len != (len + 3)) {
            STATS(len_error++);
            if(resp_len == 4) {
				// Probably an unexpected error. But no way to return a short read, so
				// just print out debug info.
                ERRV(tmp[1], "ae errcode");
                STATS(last_resp1 = tmp[1]);

                return -1;
            }
			ERRV(tmp[0], "wr len");		 // wrong length
			goto try_again;
		}

		if(!ae_check_crc(tmp, actual)) {
			ERR("bad crc");
            STATS(crc_error++);
			goto try_again;
		}

		// normal case: copy out body of message w/o framing
        memcpy(body, tmp+1, actual-3);

#ifdef DEV_STATS
        memcpy(stats.last_n_data, body, MIN(32, actual-3));
        stats.last_n_len =  actual-3;
#endif

		return 0;

	try_again:
        STATS(ln_retry++);
        ae_wake();
	}

	return -1;
}

// ae_send()
//
	void
ae_send(aeopcode_t opcode, uint8_t p1, uint16_t p2) 
{
	ae_send_n(opcode, p1, p2, NULL, 0);
}

// ae_send_n()
//
	void
ae_send_n(aeopcode_t opcode, uint8_t p1, uint16_t p2, const uint8_t *data, uint8_t data_len) 
{
	// all commands will have this fixed header, which includes just one layer of framing
	struct {
		uint8_t	ioflag;
		uint8_t	framed_len;
		uint8_t	op;
		uint8_t	p1;
		uint8_t	p2_lsb;
		uint8_t	p2_msb;
	} known = { 
        .ioflag = IOFLAG_CMD,
		.framed_len = (data_len + 7),		// 7 = (1 len) + (4 bytes of msg) + (2 crc)
		.op = opcode,
		.p1 = p1,
		.p2_lsb = p2 & 0xff,
		.p2_msb = (p2 >> 8) & 0xff,
	};

	STATIC_ASSERT(sizeof(known) == 6);

    STATS(last_op = opcode);
    STATS(last_p1 = p1);
    STATS(last_p2 = p2);

    // important to wake chip at this point.
    ae_wake();

    _send_serialized((const uint8_t *)&known, sizeof(known));

	// CRC will start from frame_len onwards
	uint8_t crc[2] = {0, 0};
	crc16_chain(sizeof(known)-1, &known.framed_len, crc);

	// insert a variable-length body area (sometimes)
	if(data_len) {
        _send_serialized(data, data_len);
		
		crc16_chain(data_len, data, crc);
	}

	// send final CRC bytes
    _send_serialized(crc, 2);
}

// ae_delay()
//
// Delay for worse-case time. Except new data sheets says it's
// not worst-case or even typical time! Useless.
//
	void
ae_delay(aeopcode_t opcode)
{
	// no longer required -- instead we just want for chip
    // to give us a response (by polling it)
}

#if 0
// RISKY - Easy for Mitm to control value.

// ae_random()
//
// Get a fresh random number.
//
	int
ae_random(uint8_t randout[32])
{
	int rv;

	ae_send(OP_Random, 0, 0);

	ae_delay(OP_Random);

	rv = ae_read_n(32, randout);
	RET_IF_BAD(rv);

	return 0;
}
#endif

// ae_get_info()
//
// Do Info(p1=2) command, and return result.
//
	uint16_t
ae_get_info(void)
{
	// not doing error checking here
	ae_send(OP_Info, 0x2, 0);

	ae_delay(OP_Info);

	// note: always returns 4 bytes, but most are garbage and unused.
	uint8_t tmp[4];
	ae_read_n(4, tmp);

	return (tmp[0] << 8) | tmp[1];
}

#if 0
// ae_delay_time()
//
// Returns time in MS for max exec time of each command.
//
	int
ae_delay_time(aeopcode_t opcode)
{
	// worse case delay times.
	switch(opcode) {
		case OP_CheckMac:		// 0x28
			return 13;
		case OP_Counter:		// 0x24
			return 20;
		case OP_DeriveKey:		// 0x1C
			return 50;
		case OP_ECDH:			// 0x43
			return 58;
		case OP_GenDig:			// 0x15
			return 11;
		case OP_GenKey:			// 0x40
			return 115;
#if FOR_508
		case OP_HMAC:			// 0x11
			return 23;
		case OP_Pause:			// 0x01
			return 3;
#endif
		case OP_Info:			// 0x30
			return 2;					// officially 1, but marginal
		case OP_Lock:			// 0x17
			return 32;
		case OP_MAC:			// 0x08
			return 14;
		case OP_Nonce:			// 0x16
			return 30;					// officially 7, but need 30 for real
		case OP_PrivWrite:		// 0x46
			return 48;
		case OP_Random:			// 0x1B
			return 23;
		case OP_Read:			// 0x02
			return 1;
		case OP_Sign:			// 0x41
			return 50;
		case OP_SHA:			// 0x47
			return 9;
		case OP_UpdateExtra:	// 0x20
			return 10;
		case OP_Verify:			// 0x45
			return 58;
		case OP_Write:			// 0x12
			return 26;

#if FOR_608
        case OP_AES:            // 0x51
            return 3;
        case OP_KDF:            // 0x56
            return 115;
        case OP_SecureBoot:     // 0x80
            return 35;
        case OP_SelftTest:      // 0x77
            return 200;
#endif
	}

