Coldcard/firmware/stm32/mk4-bootloader/ae.c
#if 0
	// double check?
	uint16_t ii = ae_get_info();
	// expect 0x005d for key 11

	if(!I_AuthValid(ii) || (I_AuthKey(ii) != keynum)) {
		ERR("Info r/b");
		return -1;
	}
#endif

	// just in case ... always restart watchdog timer.
	ae_keep_alive();

	return 0;
}

// ae_sign()
//
// Sign a message (already digested)
//
	int
ae_sign(uint8_t keynum, uint8_t msg_hash[32], uint8_t signature[64])
{
	int rv = ae_load_nonce(msg_hash);
	RET_IF_BAD(rv);

	ae_send_n(OP_Sign, 0x80, keynum, NULL, 0);

	ae_delay(OP_Sign);

	rv = ae_read_n(64, signature);
	RET_IF_BAD(rv);

	return 0;
}

// ae_get_counter()
//
// Just read a one-way counter.
//
	int
ae_get_counter(uint32_t *result, uint8_t counter_number)
{
    ae_send(OP_Counter, 0x0, counter_number);
    ae_delay(OP_Counter);

    int rv = ae_read_n(4, (uint8_t *)result);
    RET_IF_BAD(rv);

    // IMPORTANT: Always verify the counter's value because otherwise
    // nothing prevents an active MitM changing the value that we think
    // we just read.

    uint8_t     digest[32];
    rv = ae_gendig_counter(counter_number, *result, digest);
	RET_IF_BAD(rv);

    if(!ae_is_correct_tempkey(digest)) {
        // no legit way for this to happen, so just die.
        fatal_mitm();
    }

    return 0;
}

// ae_add_counter()
//
// Add-to and return a one-way counter's value. Have to go up in
// single-unit steps, but can we loop.
//
	int
ae_add_counter(uint32_t *result, uint8_t counter_number, int incr)
{
    for(int i=0; i<incr; i++) {
        ae_send(OP_Counter, 0x1, counter_number);
        ae_delay(OP_Counter);
        int rv = ae_read_n(4, (uint8_t *)result);
        RET_IF_BAD(rv);
    }

    // IMPORTANT: Always verify the counter's value because otherwise
    // nothing prevents an active MitM changing the value that we think
    // we just read. They could also stop us increamenting the counter.

    uint8_t     digest[32];
    int rv = ae_gendig_counter(counter_number, *result, digest);
	RET_IF_BAD(rv);

    if(!ae_is_correct_tempkey(digest)) {
        // no legit way for this to happen, so just die.
        fatal_mitm();
    }

    return 0;
}

#if 0
// unused code, and not supported directly on 608a
// ae_hmac()
//
// Perform HMAC on the chip, using a particular key.
//
	int
ae_hmac(uint8_t keynum, const uint8_t *msg, uint16_t msg_len, uint8_t digest[32])
{
	// setup SHA in HMAC mode.
	ae_send(OP_SHA, 0x04, keynum);

	ae_delay(OP_SHA);

	int rv = ae_read1();
	if(rv != AE_COMMAND_OK) return -1;

	// send full blocks, if any.

	while(msg_len >= 64) {
		ae_send_n(OP_SHA, 0x01, 64, msg, 64);
		ae_delay(OP_SHA);

		rv = ae_read1();
		if(rv != AE_COMMAND_OK) return -1;

		msg += 64;
		msg_len -= 64;
	}

	// finalize, with final 0 to 63 bytes
	ae_send_n(OP_SHA, 0x02, msg_len, msg, msg_len);
	RET_IF_BAD(rv);

	ae_delay(OP_SHA);

	rv = ae_read_n(32, digest);
	RET_IF_BAD(rv);

	return 0;
}
#endif

// ae_hmac32()
//
// 508a: Different opcode, OP_HMAC does exactly 32 bytes w/ less steps.
// 608a: Use old SHA256 command, but with new flags.
//
    int
ae_hmac32(uint8_t keynum, const uint8_t msg[32], uint8_t digest[32])
{
#if FOR_508
    // Load tempkey w/ message to be HMAC'ed
	int rv = ae_load_nonce(msg);
	RET_IF_BAD(rv);

	// Ask for HMAC using specific key
    ae_send(OP_HMAC, (1<<2) | (1<<6), keynum);

	ae_delay(OP_HMAC);

    return ae_read_n(32, digest);
#endif

#if FOR_608
    // Start SHA w/ HMAC setup
	ae_send(OP_SHA, 4, keynum);        // 4 = HMAC_Init

    // expect zero, meaning "ready"
	ae_delay(OP_SHA);
    int rv = ae_read1();
    RET_IF_BAD(rv);

    // send the contents to be hashed
	ae_send_n(OP_SHA, (3<<6) | 2, 32, msg, 32); // 2 = Finalize, 3=Place output

	ae_delay(OP_SHA);
    
    // read result
    return ae_read_n(32, digest);
#endif
}

// ae_get_serial()
//
// Return the serial number: it's 9 bytes, altho 3 are fixed.
//
	int
ae_get_serial(uint8_t serial[6])
{
	ae_send(OP_Read, 0x80, 0x0);

	ae_delay(OP_Read);

	uint8_t temp[32];
	int rv = ae_read_n(32, temp);
	RET_IF_BAD(rv);

    // reformat to 9 bytes.
    uint8_t ts[9];
	memcpy(ts, &temp[0], 4);
	memcpy(&ts[4], &temp[8], 5);

    // check the hard-coded values
    if((ts[0] != 0x01) || (ts[1] != 0x23) || (ts[8] != 0xEE)) return 1;

    // save only the unique bits.
    memcpy(serial, ts+2, 6);

	return 0;
}

#if 0
// ae_slot_locks()
//
// Read a 16-bit bitmask of which data slots are presently locked.
//
    int
ae_slot_locks(void)
{
    // Bytes 88, 89 in the Config zone is a bitmap of
    // which slots are locked. Have to read 4 bytes here tho
	ae_send(OP_Read, 0x00, 88/4);

	ae_delay(OP_Read);

	uint8_t tmp[4];
	int rv = ae_read_n(4, tmp);
    if(rv) return -2;

    // returns positive 16-bit number on success
	return (tmp[1] << 8) | tmp[0];
}
#endif

// ae_write_data_slot()
//
// -- can also lock it.
//
    int
ae_write_data_slot(int slot_num, const uint8_t *data, int len, bool lock_it)
{
    ASSERT(len >= 32);
    ASSERT(len <= 416);

    for(int blk=0, xlen=len; xlen>0; blk++, xlen-=32) {
        // have to write each "block" of 32-bytes, separately
        // zone => data
        ae_send_n(OP_Write, 0x80|2, (blk<<8) | (slot_num<<3), data+(blk*32), 32);

        ae_delay(OP_Write);

        int rv = ae_read1();
        RET_IF_BAD(rv);
    }

    if(lock_it) {
        ASSERT(slot_num != 8);          // no support for mega slot 8
        ASSERT(len == 32);              // probably not a limitation here

        // Assume 36/72-byte long slot, which will be partially written, and rest
        // should be ones.
        const int slot_len = (slot_num <= 7) ? 36 : 72;
        uint8_t copy[slot_len];

        memset(copy, 0xff, slot_len);
        memcpy(copy, data, len);

        // calc expected CRC
        uint8_t crc[2] = {0, 0};
        crc16_chain(slot_len, copy, crc);

        // do the lock
        ae_send(OP_Lock, 2 | (slot_num << 2), (crc[1]<<8) | crc[0]);

        ae_delay(OP_Lock);

        int rv = ae_read1();
        RET_IF_BAD(rv);
    }

    return 0;
}

// ae_gendig_slot()
//
    int
ae_gendig_slot(int slot_num, const uint8_t slot_contents[32], uint8_t digest[32])
{
    // Construct a digest on the device (and here) that depends on the secret
    // contents of a specific slot.
    uint8_t num_in[20], tempkey[32];

	rng_buffer(num_in, sizeof(num_in));
	int rv = ae_pick_nonce(num_in, tempkey);
    RET_IF_BAD(rv);

    //using Zone=2="Data" => "KeyID specifies a slot in the Data zone"
    ae_send(OP_GenDig, 0x2, slot_num);

    ae_delay(OP_GenDig);

    rv = ae_read1();
    RET_IF_BAD(rv);

    ae_keep_alive();

    // we now have to match the digesting (hashing) that has happened on
    // the chip. No feedback at this point if it's right tho.
    //
    //   msg = hkey + b'\x15\x02' + ustruct.pack("<H", slot_num)
    //   msg += b'\xee\x01\x23' + (b'\0'*25) + challenge
    //   assert len(msg) == 32+1+1+2+1+2+25+32
    //
	SHA256_CTX ctx;
    sha256_init(&ctx);

	uint8_t args[7] = { OP_GenDig, 2, slot_num, 0, 0xEE, 0x01, 0x23 };
    uint8_t zeros[25] = { 0 };

    sha256_update(&ctx, slot_contents, 32);
    sha256_update(&ctx, args, sizeof(args));
    sha256_update(&ctx, zeros, sizeof(zeros));
    sha256_update(&ctx, tempkey, 32);

    sha256_final(&ctx, digest);

