Coldcard/firmware/stm32/mk4-bootloader/ae.c
        STATIC_ASSERT(sizeof(config_1) == 84-16);
        STATIC_ASSERT(sizeof(config_2) == 128-90);

        memcpy(&config[16], config_1, sizeof(config_1));
        memcpy(&config[90], config_2, sizeof(config_2));

        // write it.
        if(ae_config_write(config)) {
            INCONSISTENT("conf wr");
        }

        ae_keep_alive();

        // lock config zone
        if(ae_lock_config_zone(config)) {
            INCONSISTENT("conf lock");
        }
    } else {
        // check config is what we need? but when would that happen?
        // omit this check, since only useful for debug cases
    }

    // Load data zone with some known values.
    // The datazone still unlocked, so no encryption needed (nor possible).
    
    // will use zeros for all PIN codes, and customer-defined-secret starting values
    uint8_t     zeros[72];
    memset(zeros, 0, sizeof(zeros));

    // slots can already locked, if we re-run any of this code... can't overwrite in
    // that case.
    uint16_t unlocked = config[88] | (((uint8_t)config[89])<<8);

    for(int kn=0; kn<16; kn++) {
        ae_keep_alive();

        if(!(unlocked & (1<<kn))) {
            STATS(was_locked |= (1<<kn));
            continue;
        }

        switch(kn) {
            default:
            case 12: break;
            case 15: break;

            case KEYNUM_pairing:
                if(ae_write_data_slot(kn, rom_secrets->pairing_secret, 32, false)) {
                    INCONSISTENT("wr pair");
                }
                break;

            case KEYNUM_pin_stretch:
            case KEYNUM_pin_attempt: {
                    // HMAC-SHA256 key (forgotten immediately), for:
                    // - phishing words
                    // - each pin attempt (limited by counter0)
                    // - stretching pin/words attempts (iterated may times)
                    // See mathcheck.py for details.
                    uint8_t     tmp[32];

                    rng_buffer(tmp, sizeof(tmp));
                    //#warning "fixed secrets"
                    //memset(tmp, 0x41+kn, 32);

                    if(ae_write_data_slot(kn, tmp, 32, true)) {
                        INCONSISTENT("wr word");
                    }
                }
                break;

            case KEYNUM_main_pin:
            case KEYNUM_lastgood:
            case KEYNUM_duress_pin:
            case KEYNUM_duress_lastgood:
            case KEYNUM_brickme:
            case KEYNUM_firmware:
                if(ae_write_data_slot(kn, zeros, 32, false)) {
                    INCONSISTENT("wr blk 32");
                }
                break;

            case KEYNUM_secret:
            case KEYNUM_duress_secret:
                if(ae_write_data_slot(kn, zeros, 72, false)) {
                    INCONSISTENT("wr blk 72");
                }
                break;

            case KEYNUM_long_secret: {            // 416 bytes
                uint8_t long_zeros[416] = {0};
                if(ae_write_data_slot(kn, long_zeros, 416, false)) {
                    INCONSISTENT("wr blk 416");
                }
                break;
            }

            case KEYNUM_match_count: {
                uint32_t     buf[32/4] = { 1024, 1024 };
                if(ae_write_data_slot(KEYNUM_match_count, (const uint8_t *)buf,sizeof(buf),false)) {
                    INCONSISTENT("wr mc");
                }
                break;
            }

            case 0:
                if(ae_write_data_slot(kn, (const uint8_t *)copyright_msg, 32, true)) {
                    INCONSISTENT("wr (c)");
                }
                break;
        }
    }

    // lock the data zone and effectively enter normal operation.
    ae_keep_alive();
    if(ae_lock_data_zone()) {
        INCONSISTENT("data lock");
    }

    return 0;
}


#if 0
// ae_write_match_count()
//
    int
ae_write_match_count(uint32_t count, const uint8_t *write_key)
{
    uint32_t     buf[8] = { count, count };

    // ASSERT(count & 31 == 0);                 // not clear, but probably should have 5LSB=0
    STATIC_ASSERT(sizeof(buf) == 32);           // limitation of ae_write_data_slot

    if(!write_key) {
        return ae_write_data_slot(KEYNUM_match_count, (const uint8_t *)buf, sizeof(buf), false);
    } else {
        return ae_encrypted_write32(KEYNUM_match_count, 0, KEYNUM_main_pin,
                                        write_key, (const uint8_t *)buf);
    }
}
#endif


// ae_stretch_iter()
//
// Do on-chip hashing, with lots of iterations.
//
// - using HMAC-SHA256 with keys that are known only to the 608a.
// - rate limiting factor here is communication time w/ 608a, not algos.
// - caution: result here is not confidential
// - cost of each iteration, approximately: 8ms
// - but our time to do each iteration is limited by software SHA256 in ae_pair_unlock
//
    int
ae_stretch_iter(const uint8_t start[32], uint8_t end[32], int iterations)
{
    ASSERT(start != end);           // we can't work inplace
    memcpy(end, start, 32);

    for(int i=0; i<iterations; i++) {
        // must unlock again, because pin_stretch is an auth'd key
        if(ae_pair_unlock()) return -2;

        int rv = ae_hmac32(KEYNUM_pin_stretch, end, end);
        RET_IF_BAD(rv);
    }

    return 0;
}

// ae_mixin_key()
//
// Apply HMAC using secret in chip as a HMAC key, then encrypt
// the result a little because read in clear over bus.
//
    int
ae_mixin_key(uint8_t keynum, const uint8_t start[32], uint8_t end[32])
{
    ASSERT(start != end);           // we can't work inplace

    if(ae_pair_unlock()) return -1;

    if(keynum != 0) {
        int rv = ae_hmac32(keynum, start, end);
        RET_IF_BAD(rv);
    } else {
        memset(end, 0, 32);
    }

    // Final value was just read over bus w/o any protection, but
    // we won't be using that, instead, mix in the pairing secret.
    //
    // Concern: what if mitm gave us some zeros or other known pattern here. We will
    // use the value provided in cleartext[sic--it's not] write back shortly (to test it).
    // Solution: one more SHA256, and to be safe, mixin lots of values!

	SHA256_CTX ctx;

    sha256_init(&ctx);
    sha256_update(&ctx, rom_secrets->pairing_secret, 32);
    sha256_update(&ctx, start, 32);
    sha256_update(&ctx, &keynum, 1);
    sha256_update(&ctx, end, 32);
    sha256_final(&ctx, end);

    return 0;
}

// EOF
